#+TITLE: NEW SHIPMENT FLOW
* Web Targets
** TODO [#C] Editable Cell
** TODO [#A] Address Geocoding
   :LOGBOOK:
   CLOCK: [2019-02-20 Wed 10:24]--[2019-02-20 Wed 10:49] =>  0:25
   CLOCK: [2019-02-18 Mon 10:55]--[2019-02-18 Mon 11:20] =>  0:25
   CLOCK: [2019-02-18 Mon 10:24]--[2019-02-18 Mon 10:49] =>  0:25
   :END:
** TODO [#B] Distance Calculate
* Mobile Targets
** DONE HomePage - Back Button 
   CLOSED: [2019-02-18 Mon 14:50]
   Remove the button at homepage which used for go back to user location.
** DONE HomePage - Begin Button
   CLOSED: [2019-02-19 Tue 10:13]
   The "begin shipment" button should display when receiver address has been choose.
** DONE New cost page.
   CLOSED: [2019-02-19 Tue 15:57]
** DONE New money cost API.
   CLOSED: [2019-02-19 Tue 15:56]
   :LOGBOOK:
   CLOCK: [2019-02-19 Tue 15:40]--[2019-02-19 Tue 15:56] =>  0:16
   CLOCK: [2019-02-19 Tue 14:28]--[2019-02-19 Tue 14:54] =>  0:26
   CLOCK: [2019-02-19 Tue 11:35]--[2019-02-19 Tue 14:08] =>  2:33
   CLOCK: [2019-02-19 Tue 11:11]--[2019-02-19 Tue 11:35] =>  0:24
   CLOCK: [2019-02-19 Tue 10:32]--[2019-02-19 Tue 10:57] =>  0:25
   :END:
*** API
**** POST 单个运单计价  {{host}}/api/wallet/price/order/calculate
#+NAME: body
#+BEGIN_SRC js
{
    "todayPriceRuleId": 7,
    "immediatePriceRuleId": 8,
    "sLat": 39.989643,
    "sLng": 116.481028,
    "expressId": "5a53e",
    "rLat": 39.989643,
    "rLng": 116.491038,
    "unit": 3,
    "recycle": true,
    "totalPart": 5
}
#+END_SRC
#+NAME: DATA
#+BEGIN_SRC js
{
    "code": "1",
    "msg": "成功",
    "data": [
        {
            "priceId": "5c6b688b7c45a87922d01dfe",
            "expressId": "5a53e",
            "createTime": "2019-02-19T10:23:07.843+0800",
            "total": 30.74,
            "base": {
                "basePrice": 15,
                "total": 15
            },
            "mileage": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "unit": {
                "unitPrice": 2.5,
                "unit": 3,
                "total": 7.5
            },
            "priority": {
                "Total": 0
            },
            "recycle": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "cod": {
                "cod": 0,
                "scale": 0.001,
                "fee": 0,
                "total": 0
            }
        },
        {
            "priceId": "5c6b688b7c45a87922d01dff",
            "expressId": "5a53e",
            "createTime": "2019-02-19T10:23:07.878+0800",
            "total": 33.83,
            "base": {
                "basePrice": 15,
                "total": 15
            },
            "mileage": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "unit": {
                "unitPrice": 2.5,
                "unit": 3,
                "total": 7.5
            },
            "priority": {
                "total": 3.09
            },
            "recycle": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "cod": {
                "cod": 0,
                "scale": 0.001,
                "fee": 0,
                "total": 0
            }
        },
        {
            "priceId": "5c6b688b7c45a87922d01e00",
            "expressId": "5a53e",
            "createTime": "2019-02-19T10:23:07.881+0800",
            "total": 36.92,
            "base": {
                "basePrice": 15,
                "total": 15
            },
            "mileage": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "unit": {
                "unitPrice": 2.5,
                "unit": 3,
                "total": 7.5
            },
            "priority": {
                "total": 6.18
            },
            "recycle": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "cod": {
                "cod": 0,
                "scale": 0.001,
                "fee": 0,
                "total": 0
            }
        },
        {
            "priceId": "5c6b688b7c45a87922d01e01",
            "expressId": "5a53e",
            "createTime": "2019-02-19T10:23:07.885+0800",
            "total": 40.01,
            "base": {
                "basePrice": 15,
                "total": 15
            },
            "mileage": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "unit": {
                "unitPrice": 2.5,
                "unit": 3,
                "total": 7.5
            },
            "priority": {
                "total": 9.27
            },
            "recycle": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "cod": {
                "cod": 0,
                "scale": 0.001,
                "fee": 0,
                "total": 0
            }
        },
        {
            "priceId": "5c6b688b7c45a87922d01e02",
            "expressId": "5a53e",
            "createTime": "2019-02-19T10:23:07.888+0800",
            "total": 43.1,
            "base": {
                "basePrice": 15,
                "total": 15
            },
            "mileage": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "unit": {
                "unitPrice": 2.5,
                "unit": 3,
                "total": 7.5
            },
            "priority": {
                "total": 12.36
            },
            "recycle": {
                "mileagePrice": 2,
                "mileage": 2.06,
                "total": 4.12
            },
            "cod": {
                "cod": 0,
                "scale": 0.001,
                "fee": 0,
                "total": 0
            }
        }
    ]
}
#+END_SRC
**** POST 确认计价 {{host}}/api/wallet/price/order/confirm
#+Name: body
#+BEGIN_SRC js
{
    "expressId": "5a53e",
    "priceId": "5c6aa2867c45a8df03695482"
}
#+END_SRC
#+NAME: result
#+BEGIN_SRC js
{

    "code": "1",
    "msg": "成功",
    "data": {
        "priceId": "5c6b688b7c45a87922d01dfe",
        "expressId": "5a53e",
        "createTime": "2019-02-19T10:23:07.843+0800",
        "total": 30.74,
        "base": {
            "basePrice": 15,
            "total": 15
        },
        "mileage": {
            "mileagePrice": 2,
            "mileage": 2.06,
            "total": 4.12
        },
        "unit": {
            "unitPrice": 2.5,
            "unit": 3,
            "total": 7.5
        },
        "priority": {
            "total": 0
        },
        "recycle": {
            "mileagePrice": 2,
            "mileage": 2.06,
            "total": 4.12
        },
        "cod": {
            "cod": 0,
            "scale": 0.001,
            "fee": 0,
            "total": 0
        }
    }
}
#+END_SRC
** DONE HomePage - Car Display
   CLOSED: [2019-02-19 Tue 16:50]
   :LOGBOOK:
   CLOCK: [2019-02-19 Tue 16:21]--[2019-02-19 Tue 16:46] =>  0:25
   :END:
   When user did not select the receiver, show all the car and not show the cost time.
** DONE Order Page - Pay success
   CLOSED: [2019-02-19 Tue 17:33]
*** DONE Driver Navigation
    CLOSED: [2019-02-19 Tue 17:33]
    When user return to homepage, the driver work page is not working.
*** DONE Charge Success
    CLOSED: [2019-02-19 Tue 17:16]
    App did not jump to the right position after user charge the money.
*** DONE Balance Refresh
    CLOSED: [2019-02-19 Tue 17:16]
    App should refresh the page after user has been charged.

